Revit 2024 API
SpatialFieldManager.RemoveSpatialFieldPrimitive Method
 Removes analysis results primitive identified by the unique index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void RemoveSpatialFieldPrimitive(
	int idx
)
Visual Basic
Public Sub RemoveSpatialFieldPrimitive ( _
	idx As Integer _
)
Visual C++
public:
void RemoveSpatialFieldPrimitive(
	int idx
)
Parameters
idx
Type: System.Int32
 Unique index identifying the primitive
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  idx refers to non-existent primitive
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace